base/Documents/бит_му_ВыбытиеНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_ВыбытиеНМА</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_му_СостоянияНМА</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>InformationRegister.бит_му_СобытияНМА</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>InformationRegister.бит_му_ПараметрыНМА</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыОперацийВыбытиеНМА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНРП</Name>
					<Comment>Счет нераспределенной прибыли</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетВзаиморасчетов</Name>
					<Comment>Счет взаиморасчетов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоВзаиморасчетов1</Name>
					<Comment>Аналитика счета взаиморасчетов 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоВзаиморасчетов2</Name>
					<Comment>Аналитика счета взаиморасчетов 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоВзаиморасчетов3</Name>
					<Comment>Аналитика счета взаиморасчетов 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоВзаиморасчетов4</Name>
					<Comment>Аналитика счета взаиморасчетов 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНДС</Name>
					<Comment>Счет налога на добавленную стоимость</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоНДС1</Name>
					<Comment>Аналитика счета налога на добавленную стоимость 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоНДС2</Name>
					<Comment>Аналитика счета налога на добавленную стоимость 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоНДС3</Name>
					<Comment>Аналитика счета налога на добавленную стоимость 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоНДС4</Name>
					<Comment>Аналитика счета налога на добавленную стоимость 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НематериальныеАктивы</Name>
					<Comment>Нематериальные активы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НематериальныйАктив</Name>
							<Comment>Нематериальный актив</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Comment>Аналитика счета Дт 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Comment>Аналитика счета Дт 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Comment>Аналитика счета Дт 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт4</Name>
							<Comment>Аналитика счета Дт 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Comment>Аналитика счета Кт 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Comment>Аналитика счета Кт 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Comment>Аналитика счета Кт 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт4</Name>
							<Comment>Аналитика счета Кт 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/бит_му_ВыбытиеНМА/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте 
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Максимальное количество субконто на счете по МУ.
	КоличествоСубконтоМУ = Метаданные.ПланыСчетов.бит_Дополнительный_2.МаксКоличествоСубконто;
	
	ЗаполнитьКэшЗначений();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	КэшРеквизитов = Новый Структура;
	КэшРеквизитов.Вставить("Дата");
	КэшРеквизитов.Вставить("Организация");
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьКэшРеквизитовФормы();

	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы,"СчетВзаиморасчетов","СубконтоВзаиморасчетов",КоличествоСубконтоМУ);
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы,"СчетНДС","СубконтоНДС",КоличествоСубконтоМУ);
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Объект.СчетВзаиморасчетов,КоличествоСубконтоМУ);									  
	бит_БухгалтерскийУчет.УстановитьНастройкиЭлементов(Элементы,НастройкиСубконто,"СубконтоВзаиморасчетов");
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Объект.СчетНДС,КоличествоСубконтоМУ);									  
	бит_БухгалтерскийУчет.УстановитьНастройкиЭлементов(Элементы,НастройкиСубконто,"СубконтоНДС");
	
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы
	                                               ,"СчетДт"
												   ,"СубконтоДт"
												   ,КоличествоСубконтоМУ
												   ,"НематериальныеАктивы"
												   ,"Элементы.НематериальныеАктивы.ТекущиеДанные");
												   
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы
	                                               ,"СчетКт"
												   ,"СубконтоКт"
												   ,КоличествоСубконтоМУ
												   ,"НематериальныеАктивы"
												   ,"Элементы.НематериальныеАктивы.ТекущиеДанные");											   
												   
	ВосстановитьКоличествоДоступныхСубконто();
	
	НастроитьОформлениеФормы();
	
	СформироватьДеревоВидовОпераций();
	СформироватьПодменюВидовОпераций();
	
	Если Параметры.Ключ.Пустая() Тогда
		// Заполним валюту МСФО.
		ЗаполнитьВалютуМСФО();
		УстановитьСостояниеДокумента();
	Иначе
		// Заполним валюту МСФО.
		ЗаполнитьВалютуМСФО(Ложь);
		УправлениеЭлементамиФормы();
	КонецЕсли;
	
	УстановитьПараметрыВыбораДляСчетов();

	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Изменение кода. Начало. 11.03.2015{{
	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда

			Если Не бит_УправлениеПользователямиВызовСервера.ЗначениеПоУмолчаниюТиповой("ЗапрашиватьВидОперацииПриВводеНового") Тогда
				
				ПриОткрытииЭтоНовыйОкончание(Неопределено, Отказ);
				
			Иначе 
			
				Оповещение = Новый ОписаниеОповещения("ВыборВидаОперацииОкончание", ЭтотОбъект); 
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("СсылкаДокумента"    , Объект.Ссылка);
				ПараметрыФормы.Вставить("ДеревоВидовОпераций", ДеревоВидовОпераций);
				ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораВидаОперацииИзДерева", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
			КонецЕсли;	
				
		Иначе
			
			ПриОткрытииПромежуточная(Отказ);
			ПриОткрытииОкончание();
			
		КонецЕсли;
		
	Иначе	
		
		ПриОткрытииОкончание();
		
	КонецЕсли;	
	// Изменение кода. Конец. 11.03.2015}}
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("Действие") Тогда
			
			Если ВРег(ВыбранноеЗначение.Действие) = ВРег("Загрузить") Тогда
				
				Если Объект.НематериальныеАктивы.Количество() > 0 Тогда
					
					Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораЗавершение", ЭтотОбъект, ВыбранноеЗначение);
					ТекстВопроса = НСтр("ru='Табличная часть ""Нематериальные активы"" будет очищена. Продолжить?';
					                    |en='Tabular part of the ""Intangible assets"" will be cleared. Continue?'");
					ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
					
				Иначе
					
					ОбработатьПодборНМА(ВыбранноеЗначение);

				КонецЕсли;
				
			Иначе
				
				ОбработатьПодборНМА(ВыбранноеЗначение);
				
			КонецЕсли;
			
		КонецЕсли; // В структуре есть поле действие 
		
	КонецЕсли; // Это структура
	
КонецПроцедуры

// Процедура - завершение выбора НМА
// 
&НаКлиенте
Процедура ОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.НематериальныеАктивы.Очистить();
	Иначе
		Возврат;
	КонецЕсли;
	
	ОбработатьПодборНМА(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ВосстановитьКоличествоДоступныхСубконто();
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_му_ВыбытиеНМА";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииСервер();
	
	КэшРеквизитов.Дата = Объект.Дата;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Не КэшРеквизитов.Организация = Объект.Организация
		И Объект.НематериальныеАктивы.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьИзменениеОрганизации", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Табличная часть ""Нематериальные активы"" будет очищена. Продолжить?';
		                    |en='Tabular part of the ""Intangible assets"" will be cleared. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ОрганизацияПриИзмененииСервер();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - завершение изменения реквизита "Организация".
// 
&НаКлиенте
Процедура ОбработатьИзменениеОрганизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.НематериальныеАктивы.Очистить();
	Иначе
		Объект.Организация = КэшРеквизитов.Организация;
		Возврат;
	КонецЕсли;
	
	ОрганизацияПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетВзаиморасчетовПриИзменении(Элемент)
	
	ПриИзмененииСчетаВзаиморасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоВзаиморасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначениеСубконто = Объект[Элемент.Имя];	
	НачалоВыбораСубконто(Элемент,СтандартнаяОбработка,Объект,"СубконтоВзаиморасчетов",ЗначениеСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоВзаиморасчетовПриИзменении(Элемент)
	
	ЗначениеСубконто = Объект[Элемент.Имя];
	ИзменениеСубконто(Объект,"СубконтоВзаиморасчетов",ЗначениеСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоВзаиморасчетовАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ПараметрыСубконто = Новый Структура;
	ПараметрыСубконто.Вставить("ИмяСубконто"       , "СубконтоВзаиморасчетов");
	ПараметрыСубконто.Вставить("ЗначениеСубконто"  , Объект[Элемент.Имя]);
	ПараметрыСубконто.Вставить("КоличествоСубконто", КоличествоСубконтоМУ);
	бит_БухгалтерияКлиент.СубконтоАвтоПодбор(Элемент, Параметры, Объект, Объект, ПараметрыСубконто);
	
КонецПроцедуры // СубконтоВзаиморасчетовАвтоПодбор()
												 
&НаКлиенте
Процедура СчетНДСПриИзменении(Элемент)
	
	ПриИзмененииСчетаНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоНДСПриИзменении(Элемент)
	
	ЗначениеСубконто = Объект[Элемент.Имя];
	ИзменениеСубконто(Объект,"СубконтоНДС",ЗначениеСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоНДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначениеСубконто = Объект[Элемент.Имя];	
	НачалоВыбораСубконто(Элемент,СтандартнаяОбработка,Объект,"СубконтоНДС",ЗначениеСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоНДСАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ПараметрыСубконто = Новый Структура;
	ПараметрыСубконто.Вставить("ИмяСубконто"       , "СубконтоНДС");
	ПараметрыСубконто.Вставить("ЗначениеСубконто"  , Объект[Элемент.Имя]);
	ПараметрыСубконто.Вставить("КоличествоСубконто", КоличествоСубконтоМУ);
	бит_БухгалтерияКлиент.СубконтоАвтоПодбор(Элемент, Параметры, Объект, Объект, ПараметрыСубконто);
	
КонецПроцедуры // СубконтоНДСАвтоПодбор()

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ИзменениеВалютыКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНематериальныеАктивы

&НаКлиенте
Процедура НематериальныеАктивыНематериальныйАктивПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НематериальныеАктивы.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииНМА(ТекущаяСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура НематериальныеАктивыСчетДтПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НематериальныеАктивы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	ИзменениеСчетаДт(Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура НематериальныеАктивыСубконтоДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НематериальныеАктивы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеСубконто  = ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные,"НематериальныеАктивы",Элемент.Имя);		
	НачалоВыбораСубконто(Элемент,СтандартнаяОбработка,ТекущиеДанные,"СубконтоДт",ЗначениеСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура НематериальныеАктивыСубконтоДтПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НематериальныеАктивы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеСубконто = ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные,"НематериальныеАктивы",Элемент.Имя);		
	ИзменениеСубконто(ТекущиеДанные,"СубконтоДт",ЗначениеСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура НематериальныеАктивыСубконтоДтАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НематериальныеАктивы.ТекущиеДанные;	
	ЗначениеСубконто = ТекущиеДанные[СтрЗаменить(Элемент.Имя, "НематериальныеАктивы", "")];	
	
	ПараметрыСубконто = Новый Структура;
	ПараметрыСубконто.Вставить("ИмяСубконто"       , "СубконтоДт");
	ПараметрыСубконто.Вставить("ЗначениеСубконто"  , ЗначениеСубконто);
	ПараметрыСубконто.Вставить("КоличествоСубконто", КоличествоСубконтоМУ);
	бит_БухгалтерияКлиент.СубконтоАвтоПодбор(Элемент, Параметры, ТекущиеДанные, Объект, ПараметрыСубконто);
													 
КонецПроцедуры // НематериальныеАктивыСубконтоДтАвтоПодбор()

&НаКлиенте
Процедура НематериальныеАктивыСчетКтПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НематериальныеАктивы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	ИзменениеСчетаКт(Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура НематериальныеАктивыСубконтоКтПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НематериальныеАктивы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеСубконто = ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные,"НематериальныеАктивы",Элемент.Имя);		
	ИзменениеСубконто(ТекущиеДанные,"СубконтоКт",ЗначениеСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура НематериальныеАктивыСубконтоКтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НематериальныеАктивы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеСубконто  = ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные,"НематериальныеАктивы",Элемент.Имя);		
	НачалоВыбораСубконто(Элемент,СтандартнаяОбработка,ТекущиеДанные,"СубконтоКт",ЗначениеСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура НематериальныеАктивыСубконтоКтАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НематериальныеАктивы.ТекущиеДанные;	
	ЗначениеСубконто = ТекущиеДанные[СтрЗаменить(Элемент.Имя, "НематериальныеАктивы", "")];	
	
	ПараметрыСубконто = Новый Структура;
	ПараметрыСубконто.Вставить("ИмяСубконто"       , "СубконтоКт");
	ПараметрыСубконто.Вставить("ЗначениеСубконто"  , ЗначениеСубконто);
	ПараметрыСубконто.Вставить("КоличествоСубконто", КоличествоСубконтоМУ);
	бит_БухгалтерияКлиент.СубконтоАвтоПодбор(Элемент, Параметры, ТекущиеДанные, Объект, ПараметрыСубконто);
													 
КонецПроцедуры // НематериальныеАктивыСубконтоКтАвтоПодбор()

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ПодборНМА(Команда)
	
	ПараметрыФормы = ЗаполнитьПараметрыПодбора();
	ОткрытьФорму("Обработка.бит_му_ПодборВНА.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

// Процедура вызывается при выборе пункта подменю "ПодменюВидаОперации" командной панели
// формы. Процедура устанавливает значение реквизита ВидОперации.
// 
&НаКлиенте 
Процедура КомандаУстановитьОперацию(Команда)

	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// Запомним предыдущие реквизиты для сравнения с новыми значениями.
	ПредыдущийВидОперации = Объект.ВидОперации;
	
	ИмяКоманды		= Команда.Имя;
	ИмяКнопки       = СтрЗаменить(ИмяКоманды, "Команда_", "");
	Позиция         = Найти(ИмяКнопки, "_");
	ИмяПодменю      = Лев(ИмяКнопки  , Позиция - 1);
	ИмяВидаОперации = Сред(ИмяКнопки , Позиция + 1);
	
	Объект.ВидОперации = КэшЗначений.ВидыОпераций[ИмяВидаОперации];
	
	Если ПредыдущийВидОперации = Объект.ВидОперации Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.НематериальныеАктивы.Количество() > 0 Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПредыдущийВидОперации", ПредыдущийВидОперации);
		
		Оповещение = Новый ОписаниеОповещения("КомандаУстановитьОперациюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru='Табличная часть ""Нематериальные активы"" будет очищена. Продолжить?';
		                    |en='Tabular part of the ""Intangible assets"" will be cleared. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);

	Иначе
		
		ЭтоНеПеревод = (Не Объект.ВидОперации = КэшЗначений.Перечисления.бит_му_ВидыОперацийВыбытиеНМА.ПереводВПредназначенныеДляПродажи);
		
		Если ЭтоНеПеревод Тогда
			// Заполним счет нераспределенной прибыли из учетной политики.
			Объект.СчетНРП = СчетНРП(Объект.Организация, Объект.Дата);
		КонецЕсли;
				
		// Установить видимость реквизитов.
		УправлениеЭлементамиФормы();
		
		Модифицированность = Истина;
		
		
	КонецЕсли;
	
КонецПроцедуры // ДействияФормыДействиеУстановитьОперацию()

// Процедура - завершение обработки команды "УстановитьОперацию".
// 
&НаКлиенте
Процедура КомандаУстановитьОперациюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.НематериальныеАктивы.Очистить();
	Иначе
		Объект.ВидОперации = ДополнительныеПараметры["ПредыдущийВидОперации"];
		Возврат;
	КонецЕсли;
	
	ЭтоНеПеревод = (Не Объект.ВидОперации = КэшЗначений.Перечисления.бит_му_ВидыОперацийВыбытиеНМА.ПереводВПредназначенныеДляПродажи);
	
	Если ЭтоНеПеревод Тогда
		// Заполним счет нераспределенной прибыли из учетной политики.
		Объект.СчетНРП = СчетНРП(Объект.Организация, Объект.Дата);
	КонецЕсли;
		
	// Установить видимость реквизитов.
	УправлениеЭлементамиФормы();
	
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НематериальныеАктивыСчетКт");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НематериальныеАктивыСубконтоКт1");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НематериальныеАктивыСубконтоКт2");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НематериальныеАктивыСубконтоКт3");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НематериальныеАктивыСубконтоКт4");
	// АПК:277-вкл	
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.НематериальныеАктивы.МодельУчета", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_му_МоделиУчетаВНА.ПоПереоцененнойСтоимости);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ВидОперации", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_му_ВидыОперацийВыбытиеНМА.ПереводВПредназначенныеДляПродажи);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",     ЦветаСтиля.ДатаГрафикаИзмененнаяФон);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.НематериальныеАктивыСчетДт);
	МассивЭлементов.Добавить(Элементы.НематериальныеАктивыСчетКт);
    МассивЭлементов.Добавить(Элементы.СчетНРП);
	МассивЭлементов.Добавить(Элементы.СчетВзаиморасчетов);
	МассивЭлементов.Добавить(Элементы.СчетНДС);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры // УстановитьПараметрыВыбораДляСчетов() 

&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшЗначений.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
	КэшЗначений.Вставить("ВидыОпераций", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_му_ВидыОперацийВыбытиеНМА));
		
	КэшПеречисления = Новый Структура;	
	КэшПеречисления.Вставить("бит_му_ВидыОперацийВыбытиеНМА", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_му_ВидыОперацийВыбытиеНМА));
	КэшПеречисления.Вставить("бит_му_РежимыПодбораВНА"		, бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_му_РежимыПодбораВНА));
	КэшПеречисления.Вставить("бит_му_МоделиУчетаВНА"		, бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_му_МоделиУчетаВНА));
	
	КэшЗначений.Вставить("Перечисления", КэшПеречисления);
		
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура ЗаполнитьКэшРеквизитовФормы()
	
	Для Каждого КэшРеквизита Из КэшРеквизитов Цикл
		
		КэшРеквизитов[КэшРеквизита.Ключ] = Объект[КэшРеквизита.Ключ];
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоВидовОпераций()

	КореньДерева = ДеревоВидовОпераций.ПолучитьЭлементы();
	
	СтрокаНовая = КореньДерева.Добавить();
	СтрокаНовая.ВидОперации = НСтр("ru='Доступные виды операций';
	                               |en='Available types of operations'");
	
	ЭлементыДерева = СтрокаНовая.ПолучитьЭлементы();
	
	Для каждого ТекЗначение Из Перечисления.бит_му_ВидыОперацийВыбытиеНМА Цикл
		
		СтрокаНовая = ЭлементыДерева.Добавить();
		СтрокаНовая.ВидОперации = ТекЗначение;	
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьДеревоВидовОпераций()

&НаСервере
Процедура СформироватьПодменюВидовОпераций()
 
	// Заполняем виды операций для группы подменю.
	Для Каждого ЭлементЗаполнения Из Объект.ВидОперации.Метаданные().ЗначенияПеречисления Цикл
		
		ИмяЗначенияПеречисления = ЭлементЗаполнения.Имя;
		ЗначениеПеречисления 	= Перечисления.бит_му_ВидыОперацийВыбытиеНМА[ИмяЗначенияПеречисления];
		
		ИмяКнопки = ИмяЗначенияПеречисления;
		
		ИмяКоманды = "Команда_" + ИмяКнопки;
		
		// Добавляем новую команду обработки выбора вида операции.
		КомандаУстановитьОперацию = Команды.Добавить(ИмяКоманды);
		КомандаУстановитьОперацию.Действие = "КомандаУстановитьОперацию";
		
		КнопкаГруппыПодменю = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы.ПодменюВидаОперации);
		КнопкаГруппыПодменю.Вид		   = ВидКнопкиФормы.КнопкаКоманднойПанели;
		КнопкаГруппыПодменю.ИмяКоманды = ИмяКоманды;
		КнопкаГруппыПодменю.Заголовок  = ЭлементЗаполнения.Синоним;
		
	КонецЦикла; 
	
КонецПроцедуры // СформироватьПодменюВидовОпераций()

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ВидыОпераций = КэшЗначений.Перечисления.бит_му_ВидыОперацийВыбытиеНМА;
	
	ЭтоПеревод = (Объект.ВидОперации = ВидыОпераций.ПереводВПредназначенныеДляПродажи);
	ЭтоПродажа = (Объект.ВидОперации = ВидыОпераций.Продажа);
	ЭтоВыбытие = (Объект.ВидОперации = ВидыОпераций.Выбытие);
	
	// Управление заголовками и видимостью колонок.
	Элементы.НематериальныеАктивыСчетДт.Заголовок = ?(ЭтоПеревод
								   ,НСтр("ru='Счет учета ВНА, предназначенных для продажи';en='Accounting Account BHA held for sale'")
								   ,НСтр("ru='Счет прочих доходов';en='The account of other income'"));
								   
	Элементы.НематериальныеАктивыСчетКт.Заголовок = ?(ЭтоПеревод
								   ,НСтр("ru='Счет резерва переоценки ВНА для продажи';en='Account revaluation reserve BHA for sale'")
								   ,НСтр("ru='Счет прочих расходов';en='The account of other expenses'"));
								   
	Элементы.НематериальныеАктивыСуммаПродажи.Видимость = ЭтоПродажа;							   
	Элементы.НематериальныеАктивыСуммаНДС.Видимость 	= ЭтоПродажа;
	
	ОтобразитьСчетДт = Не ЭтоВыбытие;
	
	Элементы.НематериальныеАктивыСчетДт.Видимость 	 = ОтобразитьСчетДт;
	Элементы.НематериальныеАктивыСубконтоДт1.Видимость = ОтобразитьСчетДт;
	Элементы.НематериальныеАктивыСубконтоДт2.Видимость = ОтобразитьСчетДт;
	Элементы.НематериальныеАктивыСубконтоДт3.Видимость = ОтобразитьСчетДт;
	Элементы.НематериальныеАктивыСубконтоДт4.Видимость = ОтобразитьСчетДт;
	
	// Управление заголовками и видимостью элементов форм.
	Элементы.ГруппаСчетаПродажи.Видимость = ЭтоПродажа;
	
	Элементы.ГруппаДополнительно.Видимость = Не ЭтоПеревод;
	
	// Изменение кода. Начало. 21.04.2014{{
	Элементы.ВалютаДокумента.Видимость = ЭтоПродажа;
	Элементы.КурсДокумента.Видимость = ЭтоПродажа;
	// Изменение кода. Конец. 21.04.2014}}
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОформлениеФормы()
	
	бит_БухгалтерскийУчет.УстановитьОформлениеСубконтоТаблицы(УсловноеОформление,
		"НематериальныеАктивы", "СубконтоДт", "КоличествоДоступныхСубконтоДт", КоличествоСубконтоМУ);
															   
	бит_БухгалтерскийУчет.УстановитьОформлениеСубконтоТаблицы(УсловноеОформление,
		"НематериальныеАктивы", "СубконтоКт", "КоличествоДоступныхСубконтоКт", КоличествоСубконтоМУ);
															   
    Элементы.ОтразитьВЗакрытомПериоде.Видимость = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(
		Пользователи.ТекущийПользователь(), ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноОтражениеДокументовВЗакрытомПериоде);

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНМА(Знач ИДСтроки)
	
	ТекущаяСтрока = Объект.НематериальныеАктивы.НайтиПоИдентификатору(ИДСтроки);
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Синхронизируем реквизиты строки НМА.
	СинхронизироватьРеквизитыСтрокиНМА(ТекущаяСтрока, "СубконтоДт");
	СинхронизироватьРеквизитыСтрокиНМА(ТекущаяСтрока, "СубконтоКт");

	ТекущаяСтрока.МодельУчета = ПолучитьМодельУчетаНМА(ТекущаяСтрока.НематериальныйАктив);
	
	Если Объект.ВидОперации = КэшЗначений.Перечисления.бит_му_ВидыОперацийВыбытиеНМА.ПереводВПредназначенныеДляПродажи
		И НЕ ТекущаяСтрока.МодельУчета = КэшЗначений.Перечисления.бит_му_МоделиУчетаВНА.ПоПереоцененнойСтоимости Тогда
		
		ТекущаяСтрока.СчетКт = Неопределено;
		
		Для Ном = 1 По КоличествоСубконтоМУ Цикл
			ТекущаяСтрока["СубконтоКт"+Ном] = Неопределено;
		КонецЦикла;
		
		ИзменениеСчетаКт(ИДСтроки);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСчетаВзаиморасчетов()
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Объект.СчетВзаиморасчетов,КоличествоСубконтоМУ);									  
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(Объект,НастройкиСубконто,"СубконтоВзаиморасчетов");
	бит_БухгалтерскийУчет.УстановитьНастройкиЭлементов(Элементы,НастройкиСубконто,"СубконтоВзаиморасчетов");
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСчетаНДС()
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Объект.СчетНДС,КоличествоСубконтоМУ);									  
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(Объект,НастройкиСубконто,"СубконтоНДС");
	бит_БухгалтерскийУчет.УстановитьНастройкиЭлементов(Элементы,НастройкиСубконто,"СубконтоНДС");
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСчетаДт(Знач Идентификатор)
	
	ТекущаяСтрока = Объект.НематериальныеАктивы.НайтиПоИдентификатору(Идентификатор);
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(ТекущаяСтрока.СчетДт,КоличествоСубконтоМУ);									  
	
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(ТекущаяСтрока,НастройкиСубконто,"СубконтоДт");

    СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущаяСтрока.СчетДт);
    
	ТекущаяСтрока.КоличествоДоступныхСубконтоДт = СвСч.КоличествоСубконто;
	
	// Синхронизируем реквизиты строки НМА.
	СинхронизироватьРеквизитыСтрокиНМА(ТекущаяСтрока, "СубконтоДт");
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСчетаКт(Знач Идентификатор)
	
	ТекущаяСтрока = Объект.НематериальныеАктивы.НайтиПоИдентификатору(Идентификатор);
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(ТекущаяСтрока.СчетКт,КоличествоСубконтоМУ);									  
	
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(ТекущаяСтрока,НастройкиСубконто,"СубконтоКт");

    СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущаяСтрока.СчетКт);
    
	ТекущаяСтрока.КоличествоДоступныхСубконтоКт = СвСч.КоличествоСубконто;
	
	// Синхронизируем реквизиты строки НМА.
	СинхронизироватьРеквизитыСтрокиНМА(ТекущаяСтрока, "СубконтоКт");
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьКоличествоДоступныхСубконто()
	
	// Восстанавливаем настройки субконто в зависимости от счетов учета.
	Для Каждого СтрокаТаблицы Из Объект.НематериальныеАктивы Цикл
        
        СвСчДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетДт);
        СвСчКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетКт);
        
		СтрокаТаблицы.КоличествоДоступныхСубконтоДт = СвСчДт.КоличествоСубконто;
		СтрокаТаблицы.КоличествоДоступныхСубконтоКт = СвСчКт.КоличествоСубконто;		
		
	КонецЦикла;											   
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВалютуМСФО(ЗаполнитьВалютуДокумента=Истина)
	
	// Получим валюту международного учета.
	ВалютаМСФО 	 = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Объект.Организация);
	СтрокаВалютаМежУчета = Строка(ВалютаМСФО);
	
	Элементы.ДекорацияВалютаМСФО.Заголовок = ?(ПустаяСтрока(СтрокаВалютаМежУчета), "НЕ УСТАНОВЛЕНА", СтрокаВалютаМежУчета);
	
	Если ЗаполнитьВалютуДокумента Тогда
		Объект.ВалютаДокумента = ВалютаМСФО;
		УстановитьКурсКратностьДокумента(Объект.ВалютаДокумента, Объект.Дата, Объект.КурсДокумента, Объект.КратностьДокумента);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьВалютуМСФО()

&НаСервереБезКонтекста
Процедура УстановитьКурсКратностьДокумента(Валюта, Дата, Курс, Кратность)
    
    СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(Валюта, Дата);
    
    Курс      = СтрКурса.Курс;
    Кратность = СтрКурса.Кратность;
    
КонецПроцедуры // ИзменениеВалюты()

&НаСервере
Процедура ЗаполнитьМоделиУчетаНМА()
	
	МассивНМА = Объект.НематериальныеАктивы.Выгрузить().ВыгрузитьКолонку("НематериальныйАктив");
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	СоответствиеНМА_МодельУчета = Новый Соответствие;
	
	// Заполнить соответствие объектов НМА и их моделей учета.
	ДокОбъект.ЗаполнитьСоответствиеНМА_МодельУчета(СоответствиеНМА_МодельУчета,МассивНМА);
	
	Для Каждого ТекСтрока Из Объект.НематериальныеАктивы Цикл
		
		ТекСтрока.МодельУчета = СоответствиеНМА_МодельУчета[ТекСтрока.НематериальныйАктив];
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМодельУчетаНМА(НМА)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	СоответствиеНМА_МодельУчета = Новый Соответствие;
	
	МодельУчета = ДокОбъект.МодельУчетаПоСоответствиюНМА(СоответствиеНМА_МодельУчета, НМА);
	
	Возврат МодельУчета;
	
КонецФункции

&НаСервере
Процедура ОбработатьПодборНМА(ВыбранноеЗначение)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьНематериальныеАктивы(ВыбранноеЗначение);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы,"СчетВзаиморасчетов","СубконтоВзаиморасчетов",КоличествоСубконтоМУ);
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы,"СчетНДС","СубконтоНДС",КоличествоСубконтоМУ);
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Объект.СчетВзаиморасчетов,КоличествоСубконтоМУ);									  
	бит_БухгалтерскийУчет.УстановитьНастройкиЭлементов(Элементы,НастройкиСубконто,"СубконтоВзаиморасчетов");
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Объект.СчетНДС,КоличествоСубконтоМУ);									  
	бит_БухгалтерскийУчет.УстановитьНастройкиЭлементов(Элементы,НастройкиСубконто,"СубконтоНДС");
	
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы
	                                               ,"СчетДт"
												   ,"СубконтоДт"
												   ,КоличествоСубконтоМУ
												   ,"НематериальныеАктивы"
												   ,"Элементы.НематериальныеАктивы.ТекущиеДанные");
												   
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы
	                                               ,"СчетКт"
												   ,"СубконтоКт"
												   ,КоличествоСубконтоМУ
												   ,"НематериальныеАктивы"
												   ,"Элементы.НематериальныеАктивы.ТекущиеДанные");											   
												   
	ВосстановитьКоличествоДоступныхСубконто();
	
КонецПроцедуры

// Процедура обрабатывает изменение даты документа.
// 
&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	// Заполним счет нераспределенной прибыли из учетной политики.
	Объект.СчетНРП = СчетНРП(Объект.Организация, Объект.Дата);
	
	УстановитьКурсКратностьДокумента(Объект.ВалютаДокумента, Объект.Дата, Объект.КурсДокумента, Объект.КратностьДокумента);
	
КонецПроцедуры

// Процедура обрабатывает изменение организации.
// 
&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	
	МассивПодразделений = Новый Массив;
	
	Для Ном = 1 По КоличествоСубконтоМУ Цикл
		МассивПодразделений.Добавить("СубконтоВзаиморасчетов" + Ном);
		МассивПодразделений.Добавить("СубконтоНДС" 			  + Ном);
	КонецЦикла;
	
	Для Каждого ТекИмяРеквизита Из МассивПодразделений Цикл
		ПараметрыПроверки = бит_ОбщегоНазначения.НовыеПараметрыПроверитьПринадлежностьАналитики();
		ПараметрыПроверки.Контейнер 			   = Объект;
		ПараметрыПроверки.ИмяРеквизита			   = ТекИмяРеквизита;
		ПараметрыПроверки.ИмяПроверочногоРеквизита = "Владелец";
		ПараметрыПроверки.ИмяКонтрольногоЗначения  = "Организация";
		ПараметрыПроверки.ИмяТипа 				   = "СправочникСсылка.ПодразделенияОрганизаций";
		ПараметрыПроверки.НачалоСообщения 		   = НСтр("ru='В документе';en='In Document'");
		ПараметрыПроверки.Заголовок 			   = НСтр("ru='Изменение значения реквизита Организация';
															       |en='Changing the details of the organization'");

		// Проверим принадлежность подразделения к выбранной организации.
		бит_ОбщегоНазначения.ПроверитьПринадлежностьАналитики(ПараметрыПроверки);
	КонецЦикла;
	
	КэшРеквизитов.Организация = Объект.Организация;
	
	ЭтоНеПеревод = (Не Объект.ВидОперации = КэшЗначений.Перечисления.бит_му_ВидыОперацийВыбытиеНМА.ПереводВПредназначенныеДляПродажи);
	
	Если ЭтоНеПеревод Тогда
		// Заполним счет нераспределенной прибыли из учетной политики.
		Объект.СчетНРП = СчетНРП(Объект.Организация, Объект.Дата);
	КонецЕсли;
	
	// Заполним валюту МСФО.
	ЗаполнитьВалютуМСФО();
	
КонецПроцедуры

// Процедура синхронизирует субконто с типом НМА с указанным в строке таблицы НМА.
// 
&НаСервере
Процедура СинхронизироватьРеквизитыСтрокиНМА(ТекущаяСтрока, ИмяСубконто)
	
	Если ТекущаяСтрока = Неопределено Тогда
		 Возврат;
	КонецЕсли; 

	Если ЗначениеЗаполнено(ТекущаяСтрока.НематериальныйАктив) Тогда
		
		ТипОС = Тип("СправочникСсылка.НематериальныеАктивы");
		
		Для Ном = 1 По КоличествоСубконтоМУ Цикл
			
			ТекИмяСубконто = ИмяСубконто + Ном;
			
			Если ТипЗнч(ТекущаяСтрока[ТекИмяСубконто]) = ТипОС Тогда
				 ТекущаяСтрока[ТекИмяСубконто] = ТекущаяСтрока.НематериальныйАктив;
			 КонецЕсли; 
		
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры // СинхронизироватьРеквизитыСтрокиНМА()

// Процедура обрабатывает изменение валюты документа. Клиент.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте
Процедура ИзменениеВалютыКлиент() 
	
	ИзменениеВалютыСервер();
	
	ТаблицаОбъекта = Объект.НематериальныеАктивы;
	
	// Спросим, а не пересчитать ли суммы.
	Если Не мКэшРеквизитовФормы.ВалютаДокумента = Объект.ВалютаДокумента 
		И ТаблицаОбъекта.Количество()>0 
		И ЗначениеЗаполнено(мКэшРеквизитовФормы.ВалютаДокумента)
		И ЗначениеЗаполнено(Объект.ВалютаДокумента)Тогда

	    Оповещение = Новый ОписаниеОповещения("ИзменениеВалютыЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Изменилась валюта документа. Пересчитать суммы документа?';
		                    |en='Document currency has changed. Recalculate document total?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ДобавитьВКэш("ВалютаДокумента");
		ДобавитьВКэш("КратностьДокумента");
		ДобавитьВКэш("КурсДокумента");

	КонецЕсли;
	
КонецПроцедуры // ИзменениеВалютыКлиент()

// Процедура-обработчик оповещения вопроса из процедуры ИзменениеВалютыКлиент.
// 
&НаКлиенте
Процедура ИзменениеВалютыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ТаблицаОбъекта = Объект.НематериальныеАктивы;
		
		Для Каждого СтрокаТаблицы Из ТаблицаОбъекта Цикл
			
			СтрокаТаблицы.СуммаПродажи = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаПродажи
																							  ,мКэшРеквизитовФормы.ВалютаДокумента
																							  ,Объект.ВалютаДокумента
																							  ,мКэшРеквизитовФормы.КурсДокумента
																							  ,Объект.КурсДокумента
																							  ,мКэшРеквизитовФормы.КратностьДокумента
																							  ,Объект.КратностьДокумента);
			
			СтрокаТаблицы.СуммаНДС = 	бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаНДС
																						     ,мКэшРеквизитовФормы.ВалютаДокумента
																						     ,Объект.ВалютаДокумента
																						     ,мКэшРеквизитовФормы.КурсДокумента
																						     ,Объект.КурсДокумента
																						     ,мКэшРеквизитовФормы.КратностьДокумента
																						     ,Объект.КратностьДокумента);
			
		КонецЦикла;
		
	КонецЕсли; 
	
	ДобавитьВКэш("ВалютаДокумента");
	ДобавитьВКэш("КратностьДокумента");
	ДобавитьВКэш("КурсДокумента");

КонецПроцедуры // ИзменениеВалютыЗавершение()

// Процедура обрабатывает изменение валюты документа.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ИзменениеВалютыСервер()
	                 
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеВалютыМодуль();
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	  
КонецПроцедуры // ИзменениеВалютыСервер()

&НаСервереБезКонтекста
Функция СчетНРП(Организация, Дата)
	
	Возврат бит_му_ОбщегоНазначения.ПолучитьСчетНРП(Организация, Дата);

КонецФункции

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	мКэшРеквизитовФормы[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры // ДобавитьВКэш()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Функция ПолучитьЗначениеСубконтоТабПоле(ТекущаяСтрока,ИмяТабличногоПоля,ИмяЭлемента)

	ЗначениеСубконто = Неопределено;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ИмяРеквизита      = СтрЗаменить(ИмяЭлемента,ИмяТабличногоПоля,"");
		ЗначениеСубконто  = ТекущаяСтрока[ИмяРеквизита];
		
	КонецЕсли; 

	Возврат ЗначениеСубконто;
	
КонецФункции // ПолучитьЗначениеСубконтоТабПоле()

&НаКлиенте
Процедура ИзменениеСубконто(Контейнер,ИмяСубконто,ЗначениеСубконто)

	СтруктураСубконто = бит_БухгалтерияКлиент.ПодготовитьСтруктуруСубконто(Контейнер,ИмяСубконто,КоличествоСубконтоМУ);
	бит_БухгалтерияВызовСервера.ОбработатьИзменениеСубконто(СтруктураСубконто,ИмяСубконто,ЗначениеСубконто,КоличествоСубконтоМУ);
	бит_БухгалтерияКлиент.ЗаполнитьСубконтоПоСтруктуре(СтруктураСубконто,Контейнер,ИмяСубконто,"",КоличествоСубконтоМУ);																   

КонецПроцедуры // ИзменениеСубконтоКлиентМУ()

&НаКлиенте
Процедура НачалоВыбораСубконто(Элемент,СтандартнаяОбработка,Контейнер,ИмяСубконто,ЗначениеСубконто)
	
	СтруктураПараметров = бит_БухгалтерияКлиент.ПодготовитьПараметрыВыбораСубконто(Контейнер, 
		ИмяСубконто, ЗначениеСубконто, КоличествоСубконтоМУ, Объект);	
	
	// Установим параметры выбора субконто.
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураПараметров);
	
КонецПроцедуры

// Процедура окончание выбора вида операции.
// 
&НаКлиенте 
Процедура ВыборВидаОперацииОкончание(СтруктураПараметров, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;	
	Если СтруктураПараметров = Неопределено Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	ПриОткрытииЭтоНовыйОкончание(СтруктураПараметров, Отказ);
		
КонецПроцедуры // ВыборВидаОперацииОкончание()

&НаКлиенте
Процедура ПриОткрытииЭтоНовыйОкончание(СтруктураПараметров, Отказ)

	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") 
		И СтруктураПараметров.Свойство("ВидОперации") Тогда
		Объект.ВидОперации = СтруктураПараметров.ВидОперации;																		   
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	ПриОткрытииПромежуточная(Отказ);
	ПриОткрытииОкончание();

КонецПроцедуры // ПриОткрытииЭтоНовыйОкончание()

&НаКлиенте
Процедура ПриОткрытииПромежуточная(Отказ)

	Если Отказ Тогда
		Если ЭтотОбъект.Открыта() Тогда
            Закрыть();
        КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда 
		Объект.ВидОперации = КэшЗначений.ВидыОпераций.Выбытие;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ПриОткрытииПромежуточная()

&НаКлиенте
Процедура ПриОткрытииОкончание()

	ЗаполнитьМоделиУчетаНМА();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	мКэшРеквизитовФормы.Вставить("ВалютаДокумента");
	мКэшРеквизитовФормы.Вставить("КурсДокумента");
	мКэшРеквизитовФормы.Вставить("КратностьДокумента");
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
КонецПроцедуры // ПриОткрытииОкончание()

&НаСервере
Функция ЗаполнитьПараметрыПодбора()

	ДокументОбъект   = РеквизитФормыВЗначение("Объект");
	ПараметрыПодбора = ДокументОбъект.ЗаполнитьПараметрыПодбора();
	
	Возврат ПараметрыПодбора;
	
КонецФункции // ЗаполнитьПараметрыПодбора()
#КонецОбласти

#КонецОбласти
